# from random import randint


# def guess_number():
#     x = randint(1, 100)

#     while True:
#         number = int(input("Введите число: "))

#         if x > number: 
#             print('Ваше число меньше того, что загадано')
#             print('Попробуйте ещё раз')
#         elif x < number: 
#             print('Ваше число больше того, что загадано')
#             print('Попробуйте ещё раз')
#         else: 
#             print('Отличная интуиция! Вы угадали число :)')
#             break
    

# guess_number()


# Импорт функции получения случайных чисел
# из модуля random.
from random import randint

# Получаем случайное число в диапазоне от 1 до 100.
number = randint(1, 100)
print('Угадайте число от 1 до 100')

while True:
    # Получаем число от пользователя и сохраняем его в переменную.
    guess = int(input('Введите число: '))
    
    # Если число меньше загаданного...
    if guess < number:
        # ...выводим сообщение.
        print('Ваше число меньше того, что загадано.')
    
    # Если число больше загаданного...
    elif guess > number:
        # ...выводим сообщение.
        print('Ваше число больше того, что загадано.')
    
    # Если число угадано...
    elif guess == number:
        # ...прерываем выполнение программы и...
        break
# ...выводим сообщение.
print('Отличная интуиция! Вы угадали число :')

